Repository: nbapps/YoutubeMinia
Catalog: YoutubeMinia/Ressources/Localizable.xcstrings
Source language: en
Languages: fr

source: %lld k subscribers
fr: %lld k abonnés

source: %lld k views
fr: %lld k vues

source: %lld m subscribers
fr: %lld m abonnés

source: %lld m views
fr: %lld m vues

source: %lld subscribers
fr: %lld abonnés

source: %lld views
fr: %lld vues

# !Any Youtube URL
source: Any YouTube URL Youtube / Shorts
fr: N'importe quelle URL Youtube / Shorts

# !Context
source: Little background
fr: Un peu de contexte

source: Copy
fr: Copier

source: Copy last thumbnail:
fr: Copier la dernière vignette

source: Corner radius
fr: Rayon de courbure

source: Dark theme
fr: Thème sombre

source: Enter YouTube video URL to generate sharable thumbnail
fr: Saisissez l'URL de la vidéo YouTube pour générer une vignette partageable

source: Export scale
fr: Échelle d'exportation

source: Fetch thumbnail from clipboard:
fr: Récupérer une vignette dans le presse-papiers :

source: Get stylish YouTube thumbnails
fr: Obtenir des vignettes YouTube élégantes

source: Invalid number
fr: Numéro non valide

source: Open app
fr: Ouvrir l'app

source: Open preferences
fr: Ouvrir les préférences

source: Our other apps
fr: Nos autres apps

source: Preferences
fr: Préférences

source: Progress
fr: Tête de lecture

source: Quit
fr: Quitter

source: Save .yttm file
fr: Sauvegarder le fichier .yttm

# !Save in Dowmloads
source: Save in Downloads
fr: Sauvegarder dans les téléchargements

source: Show channel icon
fr: Afficher l'icône de la chaine

source: Show channel name
fr: Afficher le nom de la chaine

source: Show channel sub
fr: Afficher le nombre d'abonnés

source: Show progress bar
fr: Afficher la tête de lecture

source: Show publication date
fr: Afficher la date de publication

source: Show video duration
fr: Afficher la durée de la vidéo

source: Show views count
fr: Afficher le nombre de vues

# !Since %lld day%@
source: %1$lld day%2$@ ago
fr: il y a %1$lld jour%2$@

# !Since %lld month%@
source: %1$lld month%2$@ ago
fr: il y a %1$lld moi%2$@

# !Since %lld week%@
source: %1$lld week%2$@ ago
fr: il y a %1$lld semaine%2$@

# !Since %lld year%@
source: %1$lld year%2$@ ago
fr: il y a %1$lld an%2$@

source: Source code
fr: Code source

source: Start with session
fr: Démarrer avec la sessions

source: Thanks to this app, you can create a thumbnail of an already published YouTube video for use in your montages or for sharing on the networks. Works with long videos and Shorts.
fr: Grâce à cette application, vous pouvez créer une vignette d'une vidéo YouTube déjà publiée pour l'utiliser dans vos montages ou pour la partager sur les réseaux. Fonctionne avec les vidéos longues et les Shorts.

source: The thumbnail has been saved in Downloads folder
fr: La vignette a été enregistrée dans le dossier Téléchargements

source: The thumbnail is in your clipboard
fr: La vignette se trouve dans le presse-papiers

source: This app was created following Basti Ui and Benjamin Code's network challenge. This app is open source. The Github link is below.
fr: Cette application a été créée suite au défi réseau de Basti Ui et Benjamin Code. Cette application est open source. Le lien Github est ci-dessous.

source: Thumbnail padding
fr: Marge de la vignette

source: To create a thumbnail, you can either copy and paste the Youtube url into the app, or drag and drop it into the app, or configure a keyboard shortcut to automatically generate the thumbnail after copying the URL.
fr: Pour créer une vignette, vous pouvez soit copier et coller l'URL de Youtube dans l'application, soit la faire glisser et la déposer dans l'application, soit configurer un raccourci clavier pour générer automatiquement la vignette après avoir copié l'URL.

source: You can share a configuration file with your editor so that he can use exactly the same configuration as you had created.
fr: Vous pouvez partager un fichier de configuration avec votre éditeur afin qu'il puisse utiliser exactement la même configuration que vous avez créée.

source: You can then share the image by saving it in the download folder, copying it to the clipboard or directly dragging and dropping it into your editing or graphics software.
fr: Vous pouvez ensuite partager l'image en l'enregistrant dans le dossier de téléchargement, en la copiant dans le presse-papiers ou en la glissant directement dans votre logiciel d'édition ou de graphisme.

source: My channel
fr: Ma chaine

source: This is a video title
fr: Titre de la vidéo
